msgs = {
  "welcome": "Друже! Вітаємо тебе в нашому боті.\nНижче розміщене посилання на матеріали, які допоможуть покращити твої знання з кібербезпеки. Але чи добре ти засвоїш ці правила? Чи завжди їх дотримуєшься?\nЩоб відповісти на це запитання, ми пропонуємо тобі виконати наші тести. Перший перевірить твої знання, другий — визначить твій рівень кіберзахисту.\nБажаємо успіхів та приємного користування!\n\nhttps://buklib.net/books/28625/\n\nhttps://niss.gov.ua/doslidzhennya/nacionalna-bezpeka/bezpekova-politika-ukraini-v-konteksti-formuvannya-sistemi\n\nhttps://buduysvoe.com/publications/ryzyk-menedzhment-i-ocinka-ryzykiv-na-storozhi-zahystu-vashogo-biznesu\n\nhttps://wiki.hostpro.ua/ua/knowledgebase/shifruvannja-tipi-i-algoritmi/\n\nhttps://10guards.com/ua/articles/the-most-common-types-of-cyber-attacks-in-2021/",
  "start": "Ну що ж, почнімо. Успіхів!",
  "begin": "Починаємо тест",
  "finish": "Вітаємо! Твій результат:",
  "select": "Виберіть наступний тест",
  "wrong": "✖️",
  "right": "✔️",
  "is_ready": "Готовий?",
  "help": "Бот\-вікторина з кібербезпеки, що складається з тестів на знання правил та їх дотримання\.\n\nВиконала команда *«Billy\'s boys & Йожик»*\n\nКотов П\. В\.\nКолесник В\. В\.\nКостюченко А\. В\.\nСахно В\. С\.\nСтатечний С\. В\.\nЧерненький А\. О\.",
  "error": "На жаль, сталась помилка, спробуйте ще раз"
}

test1_questions = [
  {
    "content": "Захист інформації це:",
    "options": [
      { "content": "процес збирання, накопичення, обробки, зберігання, розподілу та пошуку інформації;", "is_right": False },
      { "content": "перетворення інформації, внаслідок якого зміст інформації стає незрозумілим для суб\'єкта, який не має доступу;", "is_right": False },
      { "content": "одержання суб\'єктом можливості ознайомлення з інформацією, у тому числі за допомогою технічних засобів;", "is_right": False },
      { "content": "сукупність правил, що регламентують порядок та умови доступу суб\'єкта до інформації та її носіїв;", "is_right": False },
      { "content": "діяльність щодо запобігання витоку інформації, несанкціонованих та ненавмисних впливів на неї\\.", "is_right": True },
    ]
  },
  {
    "content": "Природні загрози безпеці інформації викликані:",
    "options": [
      { "content": "діяльністю людини;", "is_right": False },
      { "content": "помилками при проектуванні АСОІ, її елементів чи розробці програмного забезпечення;", "is_right": False },
      { "content": "впливами об\'єктивних фізичних процесів чи стихійних природних явищ, незалежних від людини;", "is_right": True },
      { "content": "корисливими мотивами зловмисників;  ", "is_right": False },
      { "content": "помилками внаслідок дій персоналу\.", "is_right": False },
    ]
  },
  {
    "content": "Штучні загрози безпеці інформації викликані:",
    "options": [
      { "content": "діяльністю людини;", "is_right": True },
      { "content": "помилками при проектуванні АСОІ, її елементів чи розробці програмного забезпечення;", "is_right": False },
      { "content": "впливами об\'єктивних фізичних процесів чи стихійних природних явищ, незалежних від людини;", "is_right": False },
      { "content": "корисливими устремліннями зловмисників;", "is_right": False },
      { "content": "помилками під час дій персоналу\.", "is_right": False },
    ]
  },
  {
    "content": "Що таке безпекова політика?",
    "options": [
      { "content": "Покрокові інструкції щодо виконання завдань безпеки", "is_right": False },
      { "content": "Загальні керівні вимоги щодо досягнення певного рівня безпеки", "is_right": False },
      { "content": "Широкі, високорівневі заяви керівництва", "is_right": True },
      { "content": "Деталізовані документи щодо обробки інцидентів безпеки", "is_right": False },
    ]
  },
  {
    "content": "Що є визначенням впливу на безпеку?",
    "options": [
      { "content": "Щось, що призводить до шкоди від загрози", "is_right": True },
      { "content": "Будь\-яка потенційна небезпека для інформації чи систем", "is_right": False },
      { "content": "Будь\-який недолік чи відсутність інформаційної безпеки", "is_right": False },
      { "content": "Потенційні втрати від загрози", "is_right": False },
    ]
  },
  {
    "content": "Ефективна програма безпеки вимагає збалансованого застосування:",
    "options": [
      { "content": "Технічних та нетехнічних методів", "is_right": True },
      { "content": "Контрзаходів та захисних механізмів", "is_right": False },
      { "content": "Фізичної безпеки та технічних засобів захисту", "is_right": False },
      { "content": "Процедур безпеки та шифрування", "is_right": False },
    ]
  },
  {
    "content": "Що з наведеного не є метою проведення аналізу ризиків?",
    "options": [
      { "content": "Делегування повноважень", "is_right": True },
      { "content": "Кількісна оцінка впливу потенційних загроз", "is_right": False },
      { "content": "Виявлення ризиків", "is_right": False },
      { "content": "Визначення балансу між впливом ризику та вартістю необхідних контрзаходів", "is_right": False },
    ]
  },
  {
    "content": "Символи тексту, що шифрується, переміщаються за певними правилами всередині блоку цього тексту, що шифрується, це метод:",
    "options": [
      { "content": "гамірування;", "is_right": False },
      { "content": "підстановки;", "is_right": False },
      { "content": "кодування;", "is_right": False },
      { "content": "перестановки;", "is_right": True },
      { "content": "аналітичних перетворень\.", "is_right": False },
      { "content": "гамування;", "is_right": False },
    ]
  },
  {
    "content": "Символи тексту, що шифрується, послідовно складаються з символами деякої спеціальної послідовності, це метод:",
    "options": [
      { "content": "гамування;", "is_right": True },
      { "content": "підстановки;", "is_right": False },
      { "content": "кодування;", "is_right": False },
      { "content": "перестановки;", "is_right": False },
      { "content": "аналітичних перетворень\.", "is_right": False },

    ]
  },
  {
    "content": "До сторонніх осіб порушників інформаційної безпеки належить:",
    "options": [
      { "content": "представники організацій, які взаємодіють з питань забезпечення життєдіяльності організації;", "is_right": False },
      { "content": "персонал, який обслуговує технічні засоби;", "is_right": False },
      { "content": "користувачі;", "is_right": False },
      { "content": "співробітники служби безпеки\.", "is_right": False },
      { "content": "представники конкуруючих організацій\.", "is_right": True },
    ]
  },
  {
    "content": "Спам, який має на меті зганьбити ту чи іншу фірму, компанію, політичного кандидата тощо:",
    "options": [
      { "content": "чорний піар;", "is_right": True },
      { "content": "фішинг;", "is_right": False },
      { "content": "нігерійські листи;", "is_right": False },
      { "content": "джерело чуток;", "is_right": False },
      { "content": "порожні листи\.", "is_right": False },
    ]
  },
  {
    "content": "Спам розповсюджує підроблені повідомлення від імені банків або фінансових компаній, метою яких є збір логінів, паролів та пін\-кодів користувачів:",
    "options": [
      { "content": "чорний піар;", "is_right": False },
      { "content": "фішинг;", "is_right": True },
      { "content": "нігерійські листи;", "is_right": False },
      { "content": "джерело чуток;", "is_right": False },
      { "content": "порожні листи\.", "is_right": False },
    ]
  },
  {
    "content": "Активний метод перехоплення інформації це перехоплення, яке:",
    "options": [
      { "content": "полягає у встановленні підслуховуючого пристрою в апаратуру засобів обробки інформації;", "is_right": False },
      { "content": "заснований на фіксації електромагнітних випромінювань, що виникають під час функціонування засобів комп\'ютерної техніки та комунікацій;", "is_right": False },
      { "content": "неправомірно використовує технологічні відходи інформаційного процесу;", "is_right": False },
      { "content": "здійснюється шляхом використання оптичної техніки;", "is_right": False },
      { "content": "здійснюється за допомогою підключення до телекомунікаційного обладнання комп\'ютера\.", "is_right": True },
    ]
  },
  {
    "content": "Перехоплення, яке полягає в установці підслуховуючого пристрою в апаратуру засобів обробки інформації називається:",
    "options": [
      { "content": "активне перехоплення;", "is_right": False },
      { "content": "пасивний перехоплення;", "is_right": False },
      { "content": "аудіоперехоплення;", "is_right": True },
      { "content": "відеоперехоплення;", "is_right": False },
      { "content": "перегляд сміття\.", "is_right": False },
    ]
  },
  {
    "content": "Перехоплення, що ґрунтується на фіксації електромагнітних випромінювань, що виникають при функціонуванні засобів комп\'ютерної техніки та комунікацій називається:",
    "options": [
      { "content": "активне перехоплення;", "is_right": False },
      { "content": "пасивне перехоплення;", "is_right": True },
      { "content": "аудіоперехоплення;", "is_right": False },
      { "content": "відеоперехоплення;", "is_right": False },
      { "content": "перегляд сміття\.", "is_right": False },
    ]
  },
  {
    "content": "Перехоплення, яке здійснюється шляхом використання оптичної техніки, називається:",
    "options": [
      { "content": "активне перехоплення;", "is_right": False },
      { "content": "пасивне перехоплення;", "is_right": False },
      { "content": "аудіоперехоплення;", "is_right": False },
      { "content": "відеоперехоплення;", "is_right": True },
      { "content": "перегляд сміття\.", "is_right": False },
    ]
  },
  {
    "content": "Приносити з собою особистий пристрій зазвичай…",
    "options": [
      { "content": "більш ризиковано, ніж використовувати робочий пристрій", "is_right": True },
      { "content": "так ризиковано, як і використання робочого пристрою", "is_right": False },
      { "content": "менш ризиковано, ніж використовувати робочий пристрій", "is_right": False },
    ]
  },
  {
    "content": "Який об\'єкт серед перелічених з більшою ймовірністю стане жертвою кібератаки?",
    "options": [
      { "content": "малий бізнес", "is_right": True },
      { "content": "середній бізнес", "is_right": False },
      { "content": "великий бізнес", "is_right": False },
    ]
  },
  {
    "content": "Який з паролей є найбільш безпечним?",
    "options": [
      { "content": "123456", "is_right": False },
      { "content": "дракон", "is_right": False },
      { "content": "ILoVeYou", "is_right": False },
      { "content": "Bl%Duln\!So45L", "is_right": True },
      { "content": "1q2w3e4r", "is_right": False },
    ]
  },
  {
    "content": "Хто є більшою загрозою кібербезпеці вашої організації?",
    "options": [
      { "content": "Люди поза організацією", "is_right": False },
      { "content": "Люди всередині організації", "is_right": True },
    ]
  },
  {
    "content": "Коли новий співробітник випадково завантажив шкідливу програму, в сторонній службі управління персоналом вашої компанії стався витік даних\. Інформацію про персонал вашої компанії вкрадено\.\nХто несе відповідальність за це?",
    "options": [
      { "content": "Співробітник, який завантажив програму", "is_right": False },
      { "content": "Служба управління персоналом та ваша компанія", "is_right": True },
      { "content": "Персонал, чиї дані вкрали", "is_right": False },
    ]
  },
  {
    "content": "Що з цього є важливим аспектом кібербезпеки для бізнесу?",
    "options": [
      { "content": "Використання надійних паролів", "is_right": False },
      { "content": "Встановлення антивірусів чи захисту від шкідливого ПЗ на всі комп\'ютери", "is_right": False },
      { "content": "Дотримання законів про захист даних", "is_right": False },
      { "content": "Навчання персоналу \(навіть якщо вони не пов\'язані з ІТ\)", "is_right": False },
      { "content": "Всі твердження підходять", "is_right": True },
    ]
  },
  {
    "content": "Якщо у користувача увімкнена служба VPN, його комп\'ютер неможливо заразити чи атакувати\.",
    "options": [
      { "content": "Правда", "is_right": False },
      { "content": "Ні, це не так", "is_right": True },
    ]
  },
  {
    "content": "Оберіть найточніше твердження",
    "options": [
      { "content": "Усі співробітники повинні пройти навчання з виявлення ознак кібератаки", "is_right": True },
      { "content": "Конкретні співробітники \(зокрема ІТ\-спеціалісти\) повинні пройти навчання з виявлення ознак кібератаки  ", "is_right": False },
      { "content": "Якщо на підприємстві встановлені якісні антивірусні програми, таке навчання взагалі необов\'язкове", "is_right": False },
    ]
  },
  {
    "content": "Що в першу чергу має продумати керівництво при класифікації даних?",
    "options": [
      { "content": "Типи співробітників, контрагентів та клієнтів, які матимуть доступ до даних", "is_right": False },
      { "content": "Необхідний рівень доступності, цілісності та конфіденційності", "is_right": True },
      { "content": "Оцінити рівень ризику та скасувати контрзаходи", "is_right": False },
      { "content": "Управління доступом, яке має захищати дані", "is_right": False },
    ]
  },
  {
    "content": "Хто зрештою несе відповідальність за гарантії того, що дані класифіковані та захищені?",
    "options": [
      { "content": "Власники даних", "is_right": False },
      { "content": "Користувачі", "is_right": False },
      { "content": "Адміністратори", "is_right": False },
      { "content": "Керівництво", "is_right": True },
    ]
  },
  {
    "content": "Який фактор є найбільш важливим для того, щоб бути впевненим в успішному забезпеченні безпеки в компанії?",
    "options": [
      { "content": "Підтримка вищого керівництва", "is_right": True },
      { "content": "Ефективні захисні заходи та методи їх впровадження", "is_right": False },
      { "content": "Актуальні та адекватні політики та процедури безпеки", "is_right": False },
      { "content": "Проведення тренінгів з безпеки для всіх працівників", "is_right": False },
    ]
  },
  {
    "content": "Коли доцільно не робити жодних дій щодо виявлених ризиків?",
    "options": [
      { "content": "Ніколи\.Для забезпечення хорошої безпеки потрібно враховувати та знижувати всі ризики", "is_right": False },
      { "content": "Коли ризики не можуть бути прийняті до уваги з політичних міркувань", "is_right": False },
      { "content": "Коли необхідні захисні заходи надто складні", "is_right": False },
      { "content": "Коли вартість контрзаходів перевищує цінність активу та потенційні втрати", "is_right": True },
    ]
  },
  {
    "content": "Яка з наведених технік є найважливішою у виборі конкретних захисних заходів?",
    "options": [
      { "content": "Аналіз ризиків", "is_right": False },
      { "content": "Аналіз витрат/вигоди", "is_right": True },
      { "content": "Результати ALE", "is_right": False },
      { "content": "Виявлення вразливостей та загроз, які є причиною ризику", "is_right": False },
    ]
  },
  {
    "content": "Яке твердження є правильним, якщо поглянути на різницю з метою безпеки для комерційної та військової організації?",
    "options": [
      { "content": "Тільки військові мають справжню безпеку", "is_right": False },
      { "content": "Комерційна компанія зазвичай більше піклується про цілісність та доступність даних, а військові – про конфіденційність", "is_right": True },
      { "content": "Військовим потрібен більший безпековий рівень, т\.к\. їх ризики істотно вищі", "is_right": False },
      { "content": "Комерційна компанія зазвичай більше піклується про доступність та конфіденційність даних, а військові – про цілісність", "is_right": False },
    ]
  }
]

test2_questions = [
  {
    "content": "Ви встановлюєте паролі на хатніх розумних пристроях?",
    "options": [
      { "content": "Так, завжди\. Ставлю унікальний пароль на кожен пристрій", "is_right": True },
      { "content": "Так, у мене один пароль на всі пристрої\. Завжди ставлю його, щоб не забути", "is_right": False },
      { "content": "Ні\. Навіщо?", "is_right": False },
      { "content": "А вони там є?\.\.", "is_right": False },
    ]
  },
  {
    "content": "Коли Ви в останнє оновлювати антивірус на комп\'ютері?",
    "options": [
      { "content": "Антивіруси треба оновлювати?", "is_right": False },
      { "content": "Не пам'ятаю, давно вже", "is_right": False },
      { "content": "Нещодавно, як тільки вийшло оновлення", "is_right": True },
      { "content": "У мене Мас, мені не потрібний антивірус 😎", "is_right": False },
      { "content": "Антивіруси слідкують за мною, принципово не встановлюю", "is_right": False },
    ]
  },
  {
    "content": "Ви поїхали в закордонне відрядження і вам терміново треба зайти в корпоративну мережу, щоб завантажити важливий файл\. ",
    "options": [
      { "content": "Просто під'єднаюсь і завантажу файл", "is_right": False },
      { "content": "Під'єднаюсь, завантажу файл і в кінці сесії перевірю, що мережа не збереглась у списку довірених", "is_right": False },
      { "content": "Під'єднаюсь, увімкну VPN, а після завантажу файл", "is_right": False },
      { "content": "Під'єднаюсь, увімкну VPN, завантажу файл, а потім переконаюсь, що мережа не збереглась у списку довірених", "is_right": True },
    ]
  },
  {
    "content": "Під час реєстрації на онлайн\-конференцію система автоматично встановила на ваш аккаунт пароль «01234»\. Що будете ",
    "options": [
      { "content": "Та нормальний пароль, легко запам'ятати\. Нічого не робитиму", "is_right": False },
      { "content": "Встановлю новый, складний і унікальний пароль", "is_right": True },
      { "content": "Заміню на дату народження\. Можливо народження кота", "is_right": False },
      { "content": "Заміню на надійний складний пароль, який використовую на схожих аккаунтах", "is_right": False },
    ]
  },
  {
    "content": "Ви залишили робочий ноутбук в офісі, а вам терміново треба зробити презентацію\. Домашнім комп\'ютером ви давно не ",
    "options": [
      { "content": "Оновлю операційну систему, це швидко\. А антивірус якось потім", "is_right": False },
      { "content": "Оновлю і антивірус, і ОС", "is_right": False },
      { "content": "Оновлю ОС, антивірус, ще й повну антивірусну перевірку виконаю", "is_right": True },
      { "content": "Все потім, спочатку презентація", "is_right": False },
    ]
  },
  {
    "content": "Уявіть, що ви знаходитесь поза офісом і вам терміново необхідно відправити контрагенту email з конфіденційним ",
    "options": [
      { "content": "Уточню у контрагента його особисту почту та відправлю файл зі свого особистого аккаунта", "is_right": False },
      { "content": "Відправлю вкладення зі своєї особистої пошти на пошту контрагента", "is_right": False },
      { "content": "Відправлю через мессенджер", "is_right": False },
      { "content": "Попрошу колегу, який зараз в офісі, відправити файл на роботу почту контрагента", "is_right": True },
    ]
  },
  {
    "content": "Вам терміново потрібно відправити з телефона фото свого паспорта одному з родичів\. Ваші дії?",
    "options": [
      { "content": "Використаю будь\-який месенджер на телефоні", "is_right": False },
      { "content": "Оберу найбезпечніший і відправлю", "is_right": False },
      { "content": "Перевірю, чи увімкнене шифрування в чаті, і відправлю у найбезпечнішому месенджері", "is_right": False },
      { "content": "У мене на всіх месенджерах увімкнене шифрування та стоїть двофакторна аутентификація\. Можна спокійно відправляти", "is_right": True },
    ]
  },
  {
    "content": "Ви придбали новий телефон і вирішили його налаштувати\. Яка з дій може бути небезпечною для ваших даних?",
    "options": [
      { "content": "Встановлення додатку з налаштуваннями доступу за замовчуванням", "is_right": False },
      { "content": "Відмова від паролю для блокування на користь ідентифікації по біометричним даним", "is_right": False },
      { "content": "Встановлення занадто великої кількості додатків від перевірених розробників", "is_right": False },
      { "content": "Жодна з перелічених", "is_right": True },
    ]
  },
  {
    "content": "Які ознаки вказують на те, що на сайті небезпечно вводити особисті дані?",
    "options": [
      { "content": "Під час під'єднання не використовується безпечне з'єднання за протоколом HTTPS", "is_right": False },
      { "content": "Браузер видає попередження про те, що сертифікат сайту недійсний", "is_right": False },
      { "content": "Спеціальний сервіс підтверджує, що сайт фішинговий", "is_right": False },
      { "content": "Будь\-яка з цих ознак", "is_right": True },
    ]
  },
  {
    "content": "Вам телефонують, представляються співробітниками банку і повідомляють, що за вашою картою проведено підозрілу транзакцію\. Як ви вчините?",
    "options": [
      { "content": "Повідомлю номер карти, щоб не заблокували", "is_right": False },
      { "content": "Нічого не скажу, зафіксую номер і звернусь в банк\. Перевірю, чи все добре з моїм рахунком, а заодно повідомлю про шахраїв", "is_right": True },
      { "content": "Скажу номер карти, але про всяк випадок без CVC\-коду\. Навіть якщо це шахраї, без коду вони ре зможуть зняти гроші", "is_right": False },
      { "content": "Покладу слухавку\. Це точно шахраї", "is_right": False },
    ]
  }
]

tests = [
  {
    "name": "Тест №1",
    "questions": test1_questions
  },
  {
    "name": "Тест №2",
    "questions": test2_questions
  }
]
